import React from "react";
import styles from "./CourseDisc.module.css";

function CourseDisc() {
  return (
    <div className={styles.courseDisc}>
      <h2>توضیحات</h2>

      <p>
        آموزش Next.js یک قدم در پیاده‌سازی بهتر و کامل‌تر اپلکیشن‌های React به
        حساب می آید. در این دوره سعی شده Next.js را به شکل کاربردی به شما آموزش
        دهیم. افرادی که قصد دارند تا در مسیر تبدیل شدن به یک توسعه دهنده React
        گام‌های بیشتری را پشت سر بگذارند و دانش‌شان را گسترش دهند، این دوره
        می‌تواند برای‌شان بسیار مفید و کاربردی باشد. شرکت‌های بسیار زیادی نیز
        هستند که در فرصت‌های شغلی خودشان عنوان کرده‌اند که درک عمیق Next.JS یکی
        از الزام‌ها برای کارجویان است.
      </p>

      <p>
        زمانی که شما کتابخانه‌های مختلف جاوااسکریپتی را با یک معماری خاص برای
        رسیدن به هدف خاص در کنار یکدیگر قرار می‌دهید، به نتیجه نهایی به وجود
        آماده فریمورک می‌گوییم. این روز‌ها فریمورک‌ها نقش بسیار مهمی در
        برنامه‌نویسی اپلیکیشن‌های مختلف ایفا می‌کند. این نقش به قدری مهم است که
        انتخاب اشتباه می‌تواند حتی به شکست یک وبسایت بی‌انجامد.
      </p>

      <p>
        در وبسایت‌های معمولی زمانی که شما یک URL را درخواست می‌کنید مرورگر شما
        محتوای آن صفحه را کامل لود می‌کند و در نهایت در مرورگر به نمایش در
        می‌آورد اما در وبسایت‌های SPA زمانی که یکی از صفحات را درخواست می‌کنید
        ابتدا صفحه خام به همراه کد جاوااسکریپتی شما لود می‌شود که در این حالت
        چیزی برای مشاهده توسط موتور‌های جستجو وجود ندارد و بعد از چند لحظه که
        کدهای جاوااسکریپتی شما کامل فراخونی شد و اطلاعات در صفحه نمایش داده
        می‌شود. اما برای برطرف کردن این مشکل راحلی ارائه شده است با عنوان SSR که
        به شما کمک می‌کند وبسایت SPA خود را در بارگذاری اول کاملا مانند یک
        وبسایت معمولی لود کنید.
      </p>
    </div>
  );
}

export default CourseDisc;
